lengxiaohua123/qemu_s32k348_source/hw/arm/s32k348evb.c
/*
 * QEMU S32K348EVB Board Implementation
 * Based on NXP S32K3xx Data Sheet Rev. 14 (April 2026)
 * Target: BCOM Motor Controller
 *
 * Functional peripherals (all visible/usable from the host):
 *   - 16x LPUART   (chardev backend: stdio/pty/tcp/usbserial adapter)
 *   - 6x  LPSPI    (QEMU SSI bus: attach ssi-loopback / spi-flash etc.)
 *   - 8x  FlexCAN  CAN 2.0B / CAN FD (QEMU CAN bus -> host SocketCAN /
 *                  TCP bridge to CAN tools on Windows)
 *   - SIUL2 GPIO   (512 qdev gpio lines, external-interrupt capable)
 *   - EMAC         (netdev backend: tap / socket / user)
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qemu/units.h"
#include "qemu/error-report.h"
#include "qemu/log.h"
#include "qapi/error.h"
#include "qapi/visitor.h"
#include "hw/arm/s32k348evb.h"
/* s32k3_emios: 结构在 hw/timer/s32k3_emios.c 内（pwm-dump 经 QOM property 访问） */
#include "hw/misc/s32k3_clkgen.h"
#include "hw/misc/s32k3_crc.h"
#include "hw/misc/s32k3_rtc.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-clock.h"
#include "hw/core/split-irq.h"
#include "hw/core/or-irq.h"
#include "hw/core/irq.h"
#include "system/runstate.h"
#include "hw/misc/unimp.h"
#include "hw/core/loader.h"
#include "hw/arm/boot.h"
#include "hw/arm/machines-qom.h"
#include "target/arm/cpu-qom.h"
#include "target/arm/cpu.h"
#include "system/system.h"
#include "system/reset.h"
#include "system/address-spaces.h"
#include "net/can_emu.h"
#include "hw/usb/usb.h"
#include "hw/usb/hcd-ehci.h"

/* ------------------------------------------------------------------
 *  Debug macro
 * ------------------------------------------------------------------ */
#define DB_PRINT(fmt, ...)                                                  \
    do {                                                                    \
        if (S32K348EVB_DEBUG) {                                             \
            qemu_log("S32K348EVB: " fmt "\n", ##__VA_ARGS__);               \
        }                                                                   \
    } while (0)

static bool S32K348EVB_DEBUG = false;

static void s32k348evb_board_init(MachineState *machine);

/* ------------------------------------------------------------------
 *  Memory Region Helpers
 * ------------------------------------------------------------------ */
static void s32k348_create_ram_region(S32K348EVBMachineState *s,
                                      const char *name,
                                      hwaddr base, uint64_t size)
{
    MemoryRegion *ram = g_new(MemoryRegion, 1);
    memory_region_init_ram(ram, NULL, name, size, &error_fatal);
    memory_region_add_subregion(s->system_memory, base, ram);
    DB_PRINT("RAM region '%s' created: 0x%08" PRIx64 " - 0x%08" PRIx64,
             name, (uint64_t)base, (uint64_t)(base + size - 1));
}

/* ------------------------------------------------------------------
 *  LPUART x16 (functional)
 * ------------------------------------------------------------------ */
static void s32k348_uart_board_init(S32K348EVBMachineState *s)
{
    static const uint8_t lpuart_irq[S32K348_LPUART_INSTANCES] = {
        S32K348_IRQ_LPUART0,  S32K348_IRQ_LPUART1,  S32K348_IRQ_LPUART2,
        S32K348_IRQ_LPUART3,  S32K348_IRQ_LPUART4,  S32K348_IRQ_LPUART5,
        S32K348_IRQ_LPUART6,  S32K348_IRQ_LPUART7,  S32K348_IRQ_LPUART8,
        S32K348_IRQ_LPUART9,  S32K348_IRQ_LPUART10, S32K348_IRQ_LPUART11,
        S32K348_IRQ_LPUART12, S32K348_IRQ_LPUART13, S32K348_IRQ_LPUART14,
        S32K348_IRQ_LPUART15,
    };
    int i;

    for (i = 0; i < S32K348_LPUART_INSTANCES; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3_LPUART);
        SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
        Chardev *chr = serial_hd(i);
        Clock *uart_clk;
        hwaddr uart_base;

        s->uart[i] = S32K3_LPUART(dev);
        if (chr != NULL) {
            qdev_prop_set_chr(dev, "chardev", chr);
        }

        uart_clk = (i < 2 || i == 8) ? s->aips_plat_clk : s->aips_slow_clk;
        qdev_connect_clock_in(dev, "module_clk", uart_clk);
        qdev_prop_set_bit(dev, "lpuart_type", (i < 2) ? true : false);

        sysbus_realize(sbd, &error_fatal);

        if (i < 8) {
            uart_base = S32K348_LPUART0_BASE + S32K348_LPUART_OFFSET * i;
        } else {
            uart_base = S32K348_LPUART8_BASE + S32K348_LPUART_OFFSET * (i - 8);
        }
        sysbus_mmio_map(sbd, 0, uart_base);
        sysbus_connect_irq(sbd, 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m), lpuart_irq[i]));

        DB_PRINT("LPUART%d mapped @ 0x%08" PRIx64 " irq %d",
                 i, (uint64_t)uart_base, lpuart_irq[i]);
    }
}

/* ------------------------------------------------------------------
 *  LPSPI x6 (functional, SSI bus named "spi<N>")
 * ------------------------------------------------------------------ */
static void s32k348_spi_board_init(S32K348EVBMachineState *s)
{
    static const hwaddr spi_base[S32K348_LPSPI_INSTANCES] = {
        S32K348_LPSPI0_BASE, S32K348_LPSPI1_BASE, S32K348_LPSPI2_BASE,
        S32K348_LPSPI3_BASE, S32K348_LPSPI4_BASE, S32K348_LPSPI5_BASE,
    };
    static const uint8_t spi_irq[S32K348_LPSPI_INSTANCES] = {
        S32K348_IRQ_LPSPI0, S32K348_IRQ_LPSPI1, S32K348_IRQ_LPSPI2,
        S32K348_IRQ_LPSPI3, S32K348_IRQ_LPSPI4, S32K348_IRQ_LPSPI5,
    };
    int i;

    for (i = 0; i < S32K348_LPSPI_INSTANCES; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3_LPSPI);
        SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

        s->spi[i] = S32K3_LPSPI(dev);
        qdev_connect_clock_in(dev, "module_clk", s->aips_slow_clk);
        sysbus_realize(sbd, &error_fatal);
        sysbus_mmio_map(sbd, 0, spi_base[i]);
        sysbus_connect_irq(sbd, 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m), spi_irq[i]));

        DB_PRINT("LPSPI%d mapped @ 0x%08" PRIx64 " irq %d",
                 i, (uint64_t)spi_base[i], spi_irq[i]);

        if (i == 1) {
            /* LPSPI1：挂 GD3000 (MC33937) 预驱动从设备（BLDC 电机控制） */
            BusState *spi_bus = qdev_get_child_bus(dev, "spi");
            ssi_create_peripheral((SSIBus *)spi_bus, "s32k3-gd3000");
            DB_PRINT("GD3000 attached to LPSPI1");
        }
    }
}

/* ------------------------------------------------------------------
 *  FlexCAN x8 (functional CAN/CAN-FD; attach to host CAN buses)
 *
 *  Host side: create can-bus objects on the QEMU command line; the board
 *  wires FlexCAN0->canbus0 ... FlexCAN7->canbus7 when they exist:
 *
 *    -object can-bus,id=canbus0 \
 *    -object can-host-socketcan,if=can0,canbus=canbus0   (Linux)
 *
 *  or TCP bridge (works on Windows too):
 *    -object can-bus,id=canbus0 \
 *    -chardev socket,id=cansock0,host=127.0.0.1,port=29536,server=on,wait=off \
 *    -object can-host-socket,id=canhost0,canbus=canbus0,chardev=cansock0
 * ------------------------------------------------------------------ */
static void s32k348_can_board_init(S32K348EVBMachineState *s)
{
    static const hwaddr can_base[S32K348_FLEXCAN_INSTANCES] = {
        S32K348_FLEXCAN0_BASE, S32K348_FLEXCAN1_BASE,
        S32K348_FLEXCAN2_BASE, S32K348_FLEXCAN3_BASE,
        S32K348_FLEXCAN4_BASE, S32K348_FLEXCAN5_BASE,
        S32K348_FLEXCAN6_BASE, S32K348_FLEXCAN7_BASE,
    };
    static const uint8_t can_irq[S32K348_FLEXCAN_INSTANCES] = {
        S32K348_IRQ_FLEXCAN0, S32K348_IRQ_FLEXCAN1,
        S32K348_IRQ_FLEXCAN2, S32K348_IRQ_FLEXCAN3,
        S32K348_IRQ_FLEXCAN4, S32K348_IRQ_FLEXCAN5,
        S32K348_IRQ_FLEXCAN6, S32K348_IRQ_FLEXCAN7,
    };
    int i;

