lengxiaohua123/qemu_s32k348_source/hw/arm/s32k348evb.c
    for (i = 0; i < S32K348_FLEXCAN_INSTANCES; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3_FLEXCAN);
        SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
        char busname[16];
        Object *canbus_obj;

        s->can[i] = S32K3_FLEXCAN(dev);
        qdev_connect_clock_in(dev, "module_clk", s->aips_slow_clk);

        /* attach to host canbus<N> if the user created one */
        snprintf(busname, sizeof(busname), "canbus%d", i);
        canbus_obj = object_resolve_path_component(
            object_get_objects_root(), busname);
        if (canbus_obj) {
            object_property_set_link(OBJECT(dev), "canbus",
                                     canbus_obj, &error_fatal);
        } else if (i == 0) {
            /* default: private loopback bus so CAN works standalone.
             * CanBusState is a plain Object, not a Device.
             * NB: object_property_set_link() resolves the target's
             * canonical path, so the bus must be attached to a parent
             * (object_new() alone leaves it parentless and the link
             * silently fails in QEMU >= 8). */
            Object *bus = object_new(TYPE_CAN_BUS);
            object_property_add_child(OBJECT(s), "loopback-canbus0",
                                      bus);
            object_unref(bus);
            object_property_set_link(OBJECT(dev), "canbus",
                                     bus, &error_fatal);
        }

        sysbus_realize(sbd, &error_fatal);
        sysbus_mmio_map(sbd, 0, can_base[i]);
        if (i == 0) {
            /* S32K344 固件的 FlexCAN0_1_IRQn=110，S32K348 手册为 109。
             * IRQ110 在 S32K348 空闲：split-irq 双接 109+110 兼容。 */
            DeviceState *split = qdev_new(TYPE_SPLIT_IRQ);
            qdev_prop_set_uint32(split, "num-lines", 2);
            qdev_realize_and_unref(split, NULL, &error_fatal);
            qdev_connect_gpio_out(split, 0,
                                  qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                   can_irq[i]));
            qdev_connect_gpio_out(split, 1,
                                  qdev_get_gpio_in(DEVICE(&s->armv7m), 110));
            sysbus_connect_irq(sbd, 0, qdev_get_gpio_in(split, 0));
        } else {
            sysbus_connect_irq(sbd, 0,
                               qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                can_irq[i]));
        }

        DB_PRINT("FlexCAN%d mapped @ 0x%08" PRIx64 " irq %d bus %s",
                 i, (uint64_t)can_base[i], can_irq[i],
                 canbus_obj ? busname : (i == 0 ? "(loopback)" : "(none)"));
    }
}

/* ------------------------------------------------------------------
 *  TEMPSENSE (temperature sensor calibration @ 0x4037C000)
 *  TCA0/1/2 出厂校准系数；模型用 25C 典型值（TCA0=25<<4 定点）。
 * ------------------------------------------------------------------ */
static uint64_t s32k348_tempsense_read(void *opaque, hwaddr offset,
                                       unsigned size)
{
    switch (offset) {
    case 0x08: return 25u << 4;   /* TCA0 */
    case 0x0C: return 0;          /* TCA1 */
    case 0x10: return 0;          /* TCA2 */
    default: return 0;
    }
}

static void s32k348_tempsense_write(void *opaque, hwaddr offset,
                                    uint64_t value, unsigned size)
{
    /* TCA 出厂校准只读 */
}

static const MemoryRegionOps s32k348_tempsense_ops = {
    .read = s32k348_tempsense_read,
    .write = s32k348_tempsense_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = { .min_access_size = 1, .max_access_size = 4 },
};

static void s32k348_tempsense_init(S32K348EVBMachineState *s)
{
    MemoryRegion *ts = g_new0(MemoryRegion, 1);

    memory_region_init_io(ts, NULL, &s32k348_tempsense_ops, NULL,
                          "s32k348.tempsense", 0x1000);
    memory_region_add_subregion(s->system_memory, 0x4037C000, ts);
}

/* CRC (RM Ch58) @ 0x40380000 — 真实 CRC 引擎 */
static void s32k348_crc_init(S32K348EVBMachineState *s)
{
    DeviceState *crc = qdev_new(TYPE_S32K3_CRC);
    sysbus_realize(SYS_BUS_DEVICE(crc), &error_fatal);
    sysbus_mmio_map(SYS_BUS_DEVICE(crc), 0, 0x40380000);
}

/* RTC (RM Ch69) @ 0x40288000 — 秒计数 + 比较标志（IRQ 待确认中断号后接线） */
static void s32k348_rtc_init(S32K348EVBMachineState *s)
{
    DeviceState *rtc = qdev_new(TYPE_S32K3_RTC);
    sysbus_realize(SYS_BUS_DEVICE(rtc), &error_fatal);
    sysbus_mmio_map(SYS_BUS_DEVICE(rtc), 0, 0x40288000);
}

/* ------------------------------------------------------------------
 *  SIUL2 GPIO (functional)
 * ------------------------------------------------------------------ */
/* 外部信号注入：qom-set /machine inject-ext-irq <pin>（0-7 = EIRQ0-7） */
/* timer 到期拉低：保持高电平跨 IFER 滤波两拍，确认上升沿 */
static void s32k348_inject_ext_irq_fall(void *opaque)
{
    S32K348EVBMachineState *s = opaque;

    if (s->inject_last_irq) {
        qemu_set_irq(s->inject_last_irq, 0);
        s->inject_last_irq = NULL;
    }
}

static void s32k348_inject_ext_irq_set(Object *obj, Visitor *v,
                                       const char *name, void *opaque,
                                       Error **errp)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(obj);
    uint32_t pin = 0;

    if (!visit_type_uint32(v, name, &pin, errp)) {
        return;
    }
    if (pin >= 8 || !s->siul2) {
        error_setg(errp, "inject-ext-irq: pin must be 0-7");
        return;
    }
    /* 拉高并保持 20us（SIUL2 滤波需两拍同电平确认沿） */
    qemu_irq in = qdev_get_gpio_in_named(DEVICE(s->siul2), "gpio-in", pin);
    qemu_set_irq(in, 1);
    s->inject_last_irq = in;
    timer_mod_ns(s->inject_timer,
                 qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 20000);
}

static void s32k348_inject_ext_irq_get(Object *obj, Visitor *v,
                                       const char *name, void *opaque,
                                       Error **errp)
{
    uint32_t val = 0;

    visit_type_uint32(v, name, &val, errp);
}

/* FlexCAN 注入：qom-set /machine inject-can "0x5165:!WAKEAPP"
 * （id 后跟 ':' + 最多 8 字节数据）。走模型接收路径，等价总线收帧。 */
static void s32k348_inject_can_set(Object *obj, const char *value, Error **errp)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(obj);
    uint32_t id;
    const char *d = NULL;
    uint8_t data[8] = { 0 };
    int dlc = 0;

    id = (uint32_t)strtoul(value, (char **)&d, 0);
    if (d && *d == ':') {
        d++;
        dlc = strlen(d);
        if (dlc > 8) {
            dlc = 8;
        }
        memcpy(data, d, dlc);
    }
    if (s->can[0]) {
        s32k3_flexcan_inject(s->can[0], id, data, dlc);
    }
}

/* ADC 模拟输入注入：qom-set /machine inject-adc-full <ch>（ADC2 通道，
 * 固件 TempSense 用 ADC2 ch0）。拉高 adc-in[ch] → ain=65535 →
 * 转换结果 0xFFF（满量程），验证固件读到的 ADC 采集值。 */
static void s32k348_inject_adc_full_set(Object *obj, Visitor *v,
                                        const char *name, void *opaque,
                                        Error **errp)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(obj);
    uint32_t ch = 0;

    if (!visit_type_uint32(v, name, &ch, errp)) {
        return;
    }
    if (ch >= 32 || !s->adc[2]) {
        error_setg(errp, "inject-adc-full: channel must be 0-31");
        return;
    }
    qemu_set_irq(qdev_get_gpio_in_named(s->adc[2], "adc-in", ch), 1);
}

/* PWM 占空比统计打印：qom-set /machine pwm-dump 0 */
static void s32k348_pwm_dump_set(Object *obj, Visitor *v,
                                 const char *name, void *opaque,
                                 Error **errp)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(obj);
    uint32_t dummy = 0;
    int inst;

    visit_type_uint32(v, name, &dummy, errp);
    for (inst = 0; inst < 3; inst++) {
        if (s->emios[inst]) {
            fprintf(stderr, "--- eMIOS%d PWM ---\n", inst);
            object_property_set_uint(OBJECT(s->emios[inst]), "pwm-dump",
                                     0, errp);
        }
    }
}

/* MC_RGM reset_req 输出 -> 系统复位请求（电平触发） */

/* NXP sBAF boot_header（0x400000 = 0xA55AA55A，0x40000C 指向向量表）：
 * M7 复位 VTOR=0x400000 会读到 boot_header（SP 垃圾）——检测并改 VTOR 到
 * 0x40000C 指示的向量表地址（如 0x402000）。 */
static void s32k348_boot_header_reset(void *opaque)
{
    uint32_t magic, vt;

    if (address_space_read(&address_space_memory, 0x00400000,
                           MEMTXATTRS_UNSPECIFIED, &magic, 4) != 4) {
        return;
    }
    if (magic != 0xA55AA55A) {
        return;   /* 标准向量表在 0x400000——不动 */
    }
    if (address_space_read(&address_space_memory, 0x0040000C,
                           MEMTXATTRS_UNSPECIFIED, &vt, 4) != 4) {
        return;
    }
    vt &= ~3u;
    if (vt < 0x00400000) {
        return;
    }
    /* 写 SCB->VTOR（0xE000ED08）——armv7m reset 后钩子先执行，CPU 取向量前 */
    address_space_write(&address_space_memory, 0xE000ED08,
                        MEMTXATTRS_UNSPECIFIED, &vt, 4);
}

static void s32k348_system_reset_irq(void *opaque, int n, int level)
{
    if (level) {
        qemu_system_reset_request(SHUTDOWN_CAUSE_GUEST_RESET);
    }
}

