lengxiaohua123/qemu_s32k348_source/hw/arm/s32k348evb.c
/* 霍尔信号注入：qom-set /machine inject-emios-edge <ch>（eMIOS1 通道）
 * 先拉高、timer 到期拉低 → 下降沿，触发 SAIC 输入捕获（EDPOL=1 时）。 */
static void s32k348_inject_emios_edge_set(Object *obj, Visitor *v,
                                          const char *name, void *opaque,
                                          Error **errp)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(obj);
    uint32_t ch = 0;

    if (!visit_type_uint32(v, name, &ch, errp)) {
        return;
    }
    if (ch >= 24 || !s->emios[1]) {
        error_setg(errp, "inject-emios-edge: channel must be 0-23");
        return;
    }
    qemu_irq in = qdev_get_gpio_in_named(s->emios[1], "input", ch);
    qemu_set_irq(in, 1);
    s->inject_last_irq = in;
}

/* 霍尔信号注入（eMIOS2——BCOM 用 eMIOS2_ch13 IPWM 测 IGBT 温度） */
static void s32k348_inject_emios2_edge_set(Object *obj, Visitor *v,
                                           const char *name, void *opaque,
                                           Error **errp)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(obj);
    uint32_t ch = 0;

    if (!visit_type_uint32(v, name, &ch, errp)) {
        return;
    }
    if (ch >= 24 || !s->emios[2]) {
        error_setg(errp, "inject-emios2-edge: channel must be 0-23");
        return;
    }
    qemu_irq in = qdev_get_gpio_in_named(s->emios[2], "input", ch);
    qemu_set_irq(in, 1);
    timer_mod(s->inject_timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) +
              NANOSECONDS_PER_SECOND / 10);
    timer_mod_ns(s->inject_timer,
                 qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 10000);
}

static void s32k348_siul2_board_init(S32K348EVBMachineState *s)
{
    DeviceState *dev = qdev_new(TYPE_S32K3_SIUL2);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

    s->siul2 = S32K3_SIUL2(dev);
    qdev_connect_clock_in(dev, "module_clk", s->aips_plat_clk);
    sysbus_realize(sbd, &error_fatal);
    sysbus_mmio_map(sbd, 0, S32K348_SIUL2_BASE);
    sysbus_connect_irq(sbd, 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m),
                                        S32K348_IRQ_SIUL2_EIRQ0));
    for (int i = 1; i < 4; i++) {
        sysbus_connect_irq(sbd, i,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K348_IRQ_SIUL2_EIRQ0 + i));
    }
    DB_PRINT("SIUL2 mapped @ 0x%08x irq %d",
             S32K348_SIUL2_BASE, S32K348_IRQ_SIUL2_EIRQ0);

    /*
     * 外部信号注入接口：HMP/QMP `qom-set /machine inject-ext-irq <pin>`
     * 对 SIUL2 的 gpio-in 输入产生一个带滤波保持的上升沿，触发 EIRQ 外部中断
     * （固件须已配置 DIRER0/IREER0 对应 pin，如 BLDC 固件的 EIRQ7）。
     */
    s->inject_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL,
                                   s32k348_inject_ext_irq_fall, s);
    object_property_add(OBJECT(s), "inject-ext-irq", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_ext_irq_set, NULL, NULL);
    object_property_add(OBJECT(s), "inject-emios-edge", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_emios_edge_set, NULL, NULL);
    object_property_add(OBJECT(s), "inject-emios2-edge", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_emios2_edge_set, NULL, NULL);
    object_property_add(OBJECT(s), "pwm-dump", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_pwm_dump_set, NULL, NULL);
    object_property_add(OBJECT(s), "inject-adc-full", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_adc_full_set, NULL, NULL);
    object_property_add_str(OBJECT(s), "inject-can",
                            NULL, s32k348_inject_can_set);

    s32k348_tempsense_init(s);
    s32k348_crc_init(s);
    s32k348_rtc_init(s);
}

/* ------------------------------------------------------------------
 *  EMAC (functional, netdev backend)
 * ------------------------------------------------------------------ */
static void s32k348_emac_board_init(S32K348EVBMachineState *s)
{
    DeviceState *dev = qdev_new(TYPE_S32K3_EMAC);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

    s->emac = S32K3_EMAC(dev);
    qdev_connect_clock_in(dev, "module_clk", s->aips_plat_clk);
    /* QEMU 11: qemu_check_nic_model() is gone; use qemu_configure_nic_device(). */
    qemu_configure_nic_device(dev, true, NULL);
    sysbus_realize(sbd, &error_fatal);
    sysbus_mmio_map(sbd, 0, S32K348_EMAC_BASE);
    sysbus_connect_irq(sbd, 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m), S32K348_IRQ_EMAC));
    DB_PRINT("EMAC mapped @ 0x%08x irq %d",
             S32K348_EMAC_BASE, S32K348_IRQ_EMAC);
}

/* ------------------------------------------------------------------
 *  eDMA (native S32K3xx model, 32 channels)
 * ------------------------------------------------------------------ */
static void s32k348_dma_board_init(S32K348EVBMachineState *s)
{
    DeviceState *dev = qdev_new(TYPE_S32K3_EDMA);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
    int i;

    s->dma = S32K3_EDMA(dev);
    qdev_connect_clock_in(dev, "module_clk", s->aips_slow_clk);
    object_property_set_link(OBJECT(s->dma), "memory",
                             OBJECT(s->system_memory), &error_fatal);
    sysbus_realize(sbd, &error_fatal);
    sysbus_mmio_map(sbd, 0, S32K348_EDMA_BASE);
    /* RM 15.6.2.1：TCD 分两段——CH0-11 @0x40210000、CH12-31 @0x40410000 */
    sysbus_mmio_map(sbd, 1, S32K348_EDMA_TCD1_BASE);
    sysbus_mmio_map(sbd, 2, S32K348_EDMA_TCD2_BASE);


    /* channel interrupts 0-31 */
    for (i = 0; i < S32K3_EDMA_CHANNELS; i++) {
        sysbus_connect_irq(sbd, i,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K348_IRQ_EDMA_CH0 + i));
    }
    /* 手册：eDMA 完成/错误共用通道中断（IRQ 4-35），无独立 error 线。
     * 模型 err_irq（index 32）不接 NVIC。 */

    DB_PRINT("eDMA mapped @ 0x%08x (regs), 0x%08x (TCD1), 0x%08x (TCD2)",
             S32K348_EDMA_BASE, S32K348_EDMA_TCD1_BASE, S32K348_EDMA_TCD2_BASE);
}

/* ------------------------------------------------------------------
 *  Main Board Init
 * ------------------------------------------------------------------ */
static void s32k348evb_board_init(MachineState *machine)
{
    S32K348EVBMachineState *s = S32K348EVB_MACHINE(machine);

