lengxiaohua123/qemu_s32k348_source/hw/arm/s32k348evb.c
    DB_PRINT("Initializing S32K348EVB board...");

    /* 1. System Memory Bus */
    s->system_memory = get_system_memory();

    /* 2. TCM */
    s32k348_create_ram_region(s, "s32k348.itcm",
                              S32K348_ITCM_BASE, S32K348_ITCM_SIZE);
    s32k348_create_ram_region(s, "s32k348.dtcm",
                              S32K348_DTCM_BASE, S32K348_DTCM_SIZE);

    /* 3. SRAM */
    const hwaddr sram_bases[S32K348_SRAM_BLOCKS] = {
        S32K348_SRAM0_BASE, S32K348_SRAM1_BASE, S32K348_SRAM2_BASE,
    };
    for (int i = 0; i < S32K348_SRAM_BLOCKS; i++) {
        char name[32];
        snprintf(name, sizeof(name), "s32k348.sram%d", i);
        s32k348_create_ram_region(s, name,
                                  sram_bases[i], S32K348_SRAM_BLK_SIZE);
    }

    /*
     * 4. Code Flash
     *
     * Modeled as RAM-backed regions so that the CMSIS-DAP debug probe
     * (and -kernel loading) can program them.  Attach -pflash/-blockdev
     * for persistence across runs if needed.
     */
    const hwaddr flash_bases[S32K348_FLASH_BLOCKS] = {
        S32K348_FLASH0_BASE, S32K348_FLASH1_BASE,
        S32K348_FLASH2_BASE, S32K348_FLASH3_BASE,
    };
    for (int i = 0; i < S32K348_FLASH_BLOCKS; i++) {
        char name[32];
        snprintf(name, sizeof(name), "s32k348.flash%d", i);
        s32k348_create_ram_region(s, name,
                                  flash_bases[i], S32K348_FLASH_BLK_SIZE);
    }

    /* 5. Data Flash（RAM：可读写擦除，Flash 命令经 c40asf 路由） */
    s32k348_create_ram_region(s, "s32k348.dataflash",
                              S32K348_DATA_FLASH_BASE,
                              S32K348_DATA_FLASH_SIZE);

    /* 6. UTEST / TestNVM（RAM：可读写擦除） */
    s32k348_create_ram_region(s, "s32k348.utest",
                              S32K348_UTEST_BASE, S32K348_UTEST_SIZE);

    /* 7. Clock tree (created first: armv7m requires cpuclk in QEMU 11).
     *
     * 真实时钟树（RM 第 24-30 章）：
     *   FIRC(48MHz) ──┬──> PLL 参考(REFCLKSEL=1) ──> PLL_PHI0
     *   FXOSC(8MHz) ─┴──> PLL 参考(REFCLKSEL=0) ──┘
     *   MUX_0 选 FIRC_CLK 或 PLL_PHI0_CLK，经 DC_0..2 分频出
     *   CORE_CLK / AIPS_PLAT_CLK / AIPS_SLOW_CLK。
     */
    {
        DeviceState *fxosc, *pll, *cgm;

        /* FIRC 48 MHz：常量时钟 + MMIO（0x402D0000）——
         * 固件 SystemBypassPll 写 STDBY_ENABLE.fircEn 后轮询
         * STATUS_REGISTER.fircStat（bit0），须返回 1（FIRC 常开）。 */
        s->firc_clk = clock_new(OBJECT(s), "firc");
        clock_set_hz(s->firc_clk, 48000000);
        {
            DeviceState *firc = qdev_new(TYPE_S32K3_CLKGEN);
            SysBusDevice *firc_sbd = SYS_BUS_DEVICE(firc);

            qdev_prop_set_uint32(firc, "kind", CLKGEN_KIND_FIRC);
            sysbus_realize(firc_sbd, &error_fatal);
            sysbus_mmio_map(firc_sbd, 0, 0x402D0000);
        }

        /* SIRC 32 KHz：SWT 等慢速时钟源 */
        s->sirc_clk = clock_new(OBJECT(s), "sirc");
        clock_set_hz(s->sirc_clk, 32000);

        /* FXOSC：数字控制器 + 可配频率（-global s32k3-clkgen.fxosc-hz=N，
         * 默认 8MHz）。CTRL[OSCON] 使能 -> STATUS[OSC_STAT]。 */
        fxosc = qdev_new(TYPE_S32K3_CLKGEN);
        qdev_prop_set_uint32(fxosc, "kind", CLKGEN_KIND_FXOSC);
        sysbus_realize(SYS_BUS_DEVICE(fxosc), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(fxosc), 0, S32K348_FXOSC_BASE);
        s->fxosc_clk = clock_new(OBJECT(s), "fxosc");
        clock_set_hz(s->fxosc_clk,
                     object_property_get_uint(OBJECT(fxosc), "fxosc-hz",
                                              &error_abort));

        /* SXOSC：慢速外部振荡器（32 KHz）@ 0x402CC000 */
        {
            DeviceState *sxosc = qdev_new(TYPE_S32K3_CLKGEN);
            qdev_prop_set_uint32(sxosc, "kind", CLKGEN_KIND_SXOSC);
            sysbus_realize(SYS_BUS_DEVICE(sxosc), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(sxosc), 0, 0x402CC000);
        }

        /* PLL (PLLDIG)：参考 = FXOSC(0) 或 FIRC_DIV2(1) */
        pll = qdev_new(TYPE_S32K3_CLKGEN);
        qdev_prop_set_uint32(pll, "kind", CLKGEN_KIND_PLL);
        qdev_connect_clock_in(pll, "fxosc-clk", s->fxosc_clk);
        qdev_connect_clock_in(pll, "firc-clk", s->firc_clk);
        sysbus_realize(SYS_BUS_DEVICE(pll), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(pll), 0, S32K348_PLL_BASE);

        /* PLL_AUX（0x402E4000）：S32K358 固件（RTD 7.0.1）PLL 配置会访问
         * PLL_AUX 寄存器（S32K348 芯片本无此实例，但 358 固件兼容运行需要
         * 映射避免 PRECISERR）。复用 PLL 寄存器 ops（存储型——时钟树不接，
         * 358 固件写读正常、不影响 348 时钟计算）。 */
        {
            DeviceState *pllaux = qdev_new(TYPE_S32K3_CLKGEN);
            qdev_prop_set_uint32(pllaux, "kind", CLKGEN_KIND_PLL);
            sysbus_realize(SYS_BUS_DEVICE(pllaux), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(pllaux), 0, 0x402E4000);
        }

        /* MC_CGM：输出三条生成时钟 */
        cgm = qdev_new(TYPE_S32K3_CLKGEN);
        qdev_prop_set_uint32(cgm, "kind", CLKGEN_KIND_MC_CGM);
        qdev_connect_clock_in(cgm, "firc-clk", s->firc_clk);
        qdev_connect_clock_in(cgm, "pll-in-clk",
                              qdev_get_clock_out(pll, "pll-clk"));
        sysbus_realize(SYS_BUS_DEVICE(cgm), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(cgm), 0, S32K348_MCCGM_BASE);
        s->sysclk = qdev_get_clock_out(cgm, S32K3_CLKGEN_CLK_SYSCLK);
        s->aips_plat_clk = qdev_get_clock_out(cgm,
                                              S32K3_CLKGEN_CLK_AIPS_PLAT);
        s->aips_slow_clk = qdev_get_clock_out(cgm,
                                              S32K3_CLKGEN_CLK_AIPS_SLOW);
        s->clkgen = cgm;
    }

    /* 8. Cortex-M7 CPU */
    object_initialize_child(OBJECT(s), "armv7m", &s->armv7m, TYPE_ARMV7M);
    /* S32K3x reset with VTOR pointing at code flash (0x400000) */
    s->armv7m.init_svtor = S32K348_FLASH0_BASE;
    s->armv7m.init_nsvtor = S32K348_FLASH0_BASE;
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "num-irq", 256);
    qdev_prop_set_string(DEVICE(&s->armv7m), "cpu-type",
                         ARM_CPU_TYPE_NAME("cortex-m7"));
    /* S32K3 NVIC 实现 4 个优先级位（写 0xFF 读回 0xF0）——FreeRTOS
     * xPortStartScheduler 优先级位自检依赖此读回。此前用 0xE000E400
     * 只读 overlay 伪造该值，但那会遮蔽 NVIC IPR0-63 使优先级设置
     * 失效；改用真实 NVIC 的 num-prio-bits=4 属性自然产生 0xF0。 */
    qdev_prop_set_uint8(DEVICE(&s->armv7m), "num-prio-bits", 4);
    /* S32K3 的 Cortex-M7 有 16 个 MPU region（QEMU cortex-m7 默认 8）。
     * RTD 固件配置 15 个 region，缺省会漏掉 AIPS region 导致外设访问
     * 被 MPU 背景区拒绝（DACCVIOL）。 */
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "mpu-ns-regions", 16);
    /* S32K348 DTCM（0x20000000，256KB）为 TCM——真机访问不走 MPU。
     * 固件栈常放 DTCM 且 MPU 表无 DTCM 区域，须豁免 MPU 检查（否则
     * 栈访问 DACCVIOL -> HardFault handler 再用栈 -> Lockup）。 */
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "tcm-base", S32K348_DTCM_BASE);
    qdev_prop_set_uint32(DEVICE(&s->armv7m), "tcm-size", S32K348_DTCM_SIZE);
    qemu_register_reset(s32k348_boot_header_reset, s);
    object_property_set_link(OBJECT(&s->armv7m), "memory",
                             OBJECT(s->system_memory), &error_abort);
    qdev_connect_clock_in(DEVICE(&s->armv7m), "cpuclk", s->sysclk);
    sysbus_realize(SYS_BUS_DEVICE(&s->armv7m), &error_fatal);

    /* 9. Functional peripherals */
    s32k348_uart_board_init(s);
    s32k348_spi_board_init(s);
    s32k348_can_board_init(s);
    s32k348_siul2_board_init(s);
    s32k348_emac_board_init(s);
    s32k348_dma_board_init(s);

