lengxiaohua123/qemu_s32k348_source/hw/arm/s32k348evb.c
        /* RAM 控制器（PRAMC）x3：SRAM0/1/2（手册 23 章，PRCR1） */
        {
            static const hwaddr pramc_base[3] = {
                0x40264000, 0x40464000, 0x40468000,
            };
            int pi;
            for (pi = 0; pi < 3; pi++) {
                DeviceState *pramc = qdev_new("s32k3-pfc");
                qdev_prop_set_uint32(pramc, "kind", 1);
                qdev_connect_clock_in(pramc, "module_clk", s->aips_slow_clk);
                sysbus_realize(SYS_BUS_DEVICE(pramc), &error_fatal);
                sysbus_mmio_map(SYS_BUS_DEVICE(pramc), 0, pramc_base[pi]);
            }
        }

        /* STM0/1/2：每核系统定时器，4 通道共享单中断向量。
         * S32K348.h：STM0_IRQn=39、STM1_IRQn=40、STM2_IRQn=41。 */
        {
            static const struct {
                hwaddr base;
                int irq;
            } stm_cfg[] = {
                { S32K348_STM0_BASE, 39 },
                { S32K348_STM1_BASE, 40 },
                { S32K348_STM2_BASE, 41 },
            };
            int cfg;

            for (cfg = 0; cfg < ARRAY_SIZE(stm_cfg); cfg++) {
                DeviceState *stm = qdev_new("s32k3-stm");
                SysBusDevice *stm_sbd = SYS_BUS_DEVICE(stm);
                int stmi;

                qdev_connect_clock_in(stm, "module_clk", s->aips_slow_clk);
                sysbus_realize(stm_sbd, &error_fatal);
                sysbus_mmio_map(stm_sbd, 0, stm_cfg[cfg].base);
                for (stmi = 0; stmi < 4; stmi++) {
                    sysbus_connect_irq(stm_sbd, stmi,
                                       qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                        stm_cfg[cfg].irq));
                }
            }
        }

        /* WKPU + PDAC：寄存器存储（QEMU 无低功耗/外部唤醒输入） */
        {
            static const hwaddr padctl_base[] = {
                0x40294000,   /* SIUL2 PDAC1A 保留区（S32K348.h 无定义） */
                0x40298000,   /* SIUL2 PDAC1B 保留区 */
                0x4029C000,   /* SIUL2 PDAC1C 保留区 */
                0x402B4000,   /* WKPU */
            };
            int pi;
            for (pi = 0; pi < (int)ARRAY_SIZE(padctl_base); pi++) {
                DeviceState *pc = qdev_new("s32k3-wkpu");
                SysBusDevice *pc_sbd = SYS_BUS_DEVICE(pc);
                qdev_connect_clock_in(pc, "module_clk", s->aips_slow_clk);
                sysbus_realize(pc_sbd, &error_fatal);
                sysbus_mmio_map(pc_sbd, 0, padctl_base[pi]);
            }
        }

        /* SWT0 on AIPS_SLOW_CLK; timeout asserts irq only by
         * default (reset-on-timeout=false) so examples don't boot-loop.
         * 手册 S32K348 仅 SWT0 一个实例。 */
        {
            DeviceState *wt = qdev_new("s32k3-swt");
            s->swt[0] = wt;
            /* 手册 Table 431：S32K348 SWT 时钟源为 SIRC 32KHz */
            qdev_connect_clock_in(wt, "module_clk", s->sirc_clk);
            sysbus_realize(SYS_BUS_DEVICE(wt), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(wt), 0, S32K348_SWT0_BASE);
            sysbus_connect_irq(SYS_BUS_DEVICE(wt), 0,
                               qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                S32K348_IRQ_SWT0));
        }
    }

    /* 12b. unimp 占位：手册 S32K348 存在但未建模的外设。
     * 真实固件会读写这些地址，占位避免总线错误（读返回 0/写丢弃）。 */
    {
        static const struct {
            const char *name;
            hwaddr base;
            size_t size;
        } unimp[] = {
            /* AIPS0 */
            { "s32k348.erm1",      0x4000C000, 0x4000 },
            { "s32k348.xbic-ace-hse", 0x40008000, 0x4000 },
            /* AIPS1 */
            { "s32k348.axbs",      0x40200000, 0x4000 },
            { "s32k348.xbic-sys",  0x40204000, 0x4000 },
            { "s32k348.xbic-per",  0x40208000, 0x4000 },
            { "s32k348.mdm-ap",    0x40250600, 0x4000 },
            { "s32k348.sda-ap",    0x40254700, 0x4000 },
            { "s32k348.erm0",      0x4025C000, 0x4000 },
            { "s32k348.intm",      0x4027C000, 0x4000 },
            { "s32k348.virt-wrapper", 0x402A8000, 0x4000 },
            { "s32k348.dcm",       0x402AC000, 0x4000 },

            { "s32k348.tspc",      0x402C4000, 0x4000 },
            { "s32k348.sirc",      0x402C8000, 0x4000 },
            
            { "s32k348.firc",      0x402D0000, 0x4000 },
            { "s32k348.pmc",       0x402E8000, 0x4000 },
            { "s32k348.flexio",    0x40324000, 0x4000 },
            { "s32k348.sai0",      0x4036C000, 0x4000 },
            { "s32k348.lpcmp0",    0x40370000, 0x4000 },
            { "s32k348.lpcmp1",    0x40374000, 0x4000 },
            { "s32k348.jdc",       0x40394000, 0x4000 },
            
            { "s32k348.selftest-gpr",0x403B0000, 0x4000 },
            /* AIPS2 */
            { "s32k348.xbic-tcm",  0x40400000, 0x4000 },
            { "s32k348.xbic-dma",  0x40404000, 0x4000 },
            { "s32k348.xbic-ace",  0x4040C000, 0x4000 },
            { "s32k348.xbic-pram", 0x40408000, 0x4000 },
            { "s32k348.qspi",      0x404CC000, 0x4000 },
            { "s32k348.sai1",      0x404DC000, 0x4000 },
            { "s32k348.usdhc",     0x404E4000, 0x4000 },
            { "s32k348.lpcmp2",    0x404E8000, 0x4000 },
            { "s32k348.eim0",      0x4050C000, 0x4000 },
            { "s32k348.eim1",      0x40510000, 0x4000 },
            { "s32k348.eim2",      0x40514000, 0x4000 },
            /* 0xE0080000 MCM0/1/2（CM7 内核外存控制器，低风险） */
            { "s32k348.mcm",       0xE0080000, 0x4000 },
            /* QuadSPI AHB 外部 Flash 映射窗口（ARDB） */
            { "s32k348.qspi-ardb", 0x68000000, 0x1000 },
        };
        size_t i;

        for (i = 0; i < ARRAY_SIZE(unimp); i++) {
            create_unimplemented_device(unimp[i].name,
                                        unimp[i].base, unimp[i].size);
        }
        /* CMU_FC（0x402BC000）：真实模型——固件 Clock_Ip_Monitor 使能频检后
         * 轮询 SR.RS 等运行状态，unimp 读 0 会死等。 */
        {
            DeviceState *cmu = qdev_new("s32k3-cmu");
            SysBusDevice *cmu_sbd = SYS_BUS_DEVICE(cmu);

            sysbus_realize(cmu_sbd, &error_fatal);
            sysbus_mmio_map(cmu_sbd, 0, 0x402BC000);
        }
        DB_PRINT("unimp placeholder: %d peripherals", (int)ARRAY_SIZE(unimp));
    }

    /* 13. Load kernel / firmware */
    if (machine->kernel_filename) {
        DB_PRINT("Loading kernel: %s", machine->kernel_filename);
        armv7m_load_kernel(ARM_CPU(first_cpu),
                           machine->kernel_filename,
                           S32K348_FLASH0_BASE,
                           S32K348_FLASH_BLK_SIZE * S32K348_FLASH_BLOCKS);


        /* S32K3 固件带 IVT boot header（0x00400000: 0x5AA55AA5），
         * 向量表地址在 IVT+0x0C（如 0x00400800），真实启动由 bootROM
         * 解析 IVT。这里模拟：若检测到 IVT 则把 init_svtor 指向向量表。
         * 注意：ELF 段以 ROM blob 形式存在，reset 才拷入 RAM，须用
         * rom_ptr_for_as 读取。 */
        AddressSpace *cpu_as = cpu_get_address_space(first_cpu, ARMASIdx_NS);
        const void *ivt_rom = rom_ptr_for_as(cpu_as, S32K348_FLASH0_BASE, 8);
        uint32_t ivt_tag = 0;
        if (ivt_rom) {
            ivt_tag = ldl_le_p(ivt_rom);
        }
        if (ivt_tag == 0x5AA55AA5u) {
            const void *vt_rom = rom_ptr_for_as(cpu_as,
                                                S32K348_FLASH0_BASE + 0x0C,
                                                4);
            uint32_t vt = vt_rom ? ldl_le_p(vt_rom) : 0;
            if ((vt & 0xFFF00000u) != 0 && (vt & 0x7Fu) == 0) {
                DB_PRINT("S32K3 IVT detected, boot entry @ 0x%08X", vt);
                /* 0x40000C 是启动代码区（含 Reset_Handler），不是标准向量表——
                 * 不设 init_nsvtor（保持 0x400000），SP/PC 由 arm_cpu_reset
                 * 的 sBAF 检测处理（cpu.c，读 rom 拿 IVT 魔数）。 */
            }
        } else {
            /* 无 IVT：检查 0x00400000 是否有有效向量表（MSP 落在 SRAM）。
             * 若没有（固件链接到 0x00500000 等由外部启动器跳转的 APP），
             * 从 ELF entry 引导：写跳板到 0x00400000（设 MSP + 跳 entry）。 */
            const void *msp_rom = rom_ptr_for_as(cpu_as, S32K348_FLASH0_BASE, 4);
            uint32_t msp0 = msp_rom ? ldl_le_p(msp_rom) : 0;
            if ((msp0 & 0xFFF00000u) != 0x20400000u &&
                (msp0 & 0xFFF00000u) != 0x20000000u) {
                FILE *ef = fopen(machine->kernel_filename, "rb");
                uint32_t entry = 0;
                uint32_t load_base = S32K348_FLASH0_BASE;
                if (ef) {
                    uint8_t hdr[0x34];
                    if (fread(hdr, 1, 0x34, ef) == 0x34) {
                        /* ELF32 header：e_entry@0x18、e_phoff@0x1C、
                         * e_phentsize@0x2A、e_phnum@0x2C */
                        entry = ldl_le_p(hdr + 0x18);
                        uint32_t phoff = ldl_le_p(hdr + 0x1C);
                        uint16_t phentsize = ldl_le_p(hdr + 0x2A);
                        uint16_t phnum = ldl_le_p(hdr + 0x2C);
                        if (phoff && phentsize >= 0x20 && phnum &&
                            phoff + phnum * phentsize <= 0x100000) {
                            for (uint16_t p = 0; p < phnum; p++) {
                                uint8_t ph[0x20];
                                if (fseek(ef, phoff + p * phentsize, SEEK_SET) ||
                                    fread(ph, 1, 0x20, ef) != 0x20) {
                                    break;
                                }
                                /* PT_LOAD=1，p_paddr@+0x0C */
                                if (ldl_le_p(ph + 0x00) == 1) {
                                    uint32_t pa = ldl_le_p(ph + 0x0C);
                                    if (pa && pa < load_base) {
                                        load_base = pa;
                                    }
                                }
                            }
                        }
                    }
                    fclose(ef);
                }
                if (entry) {
                    /* 栈顶取 SRAM 上沿（0x2042F000 为常见固件栈区；
                     * 可被固件自身 _start 的 msr msp 覆盖）。
                     * 跳板同时把 SCB->VTOR 指向固件加载基址，使固件
                     * SystemInit 的 MPU 区域计算覆盖实际代码区。 */
                    uint32_t stack = 0x2042F000u;
                    uint32_t jp = S32K348_FLASH0_BASE + 0x08;
                    uint8_t jb[0x28];
                    stl_le_p(jb + 0x00, stack);          /* MSP */
                    stl_le_p(jb + 0x04, jp | 1);         /* Reset -> 跳板 */
                    jb[0x08] = 0x03; jb[0x09] = 0x48;    /* ldr r0,[pc,#12]; VTOR */
                    jb[0x0A] = 0x04; jb[0x0B] = 0x49;    /* ldr r1,[pc,#16]; 固件基址 */
                    jb[0x0C] = 0x01; jb[0x0D] = 0x60;    /* str r1,[r0] */
                    jb[0x0E] = 0x04; jb[0x0F] = 0x48;    /* ldr r0,[pc,#16]; stack */
                    jb[0x10] = 0x85; jb[0x11] = 0x46;    /* mov sp,r0 */
                    jb[0x12] = 0x04; jb[0x13] = 0x49;    /* ldr r1,[pc,#16]; entry */
                    jb[0x14] = 0x08; jb[0x15] = 0x47;    /* bx r1 */
                    jb[0x16] = 0x00; jb[0x17] = 0xBF;    /* nop */
                    stl_le_p(jb + 0x18, 0xE000ED80u);    /* SCB->VTOR */
                    stl_le_p(jb + 0x1C, load_base);   /* 固件实际加载基址（最低 PT_LOAD） */
                    stl_le_p(jb + 0x20, stack);
                    stl_le_p(jb + 0x24, entry | 1);
                    rom_add_blob_fixed_as("s32k348-elf-jump", jb,
                                          sizeof(jb), S32K348_FLASH0_BASE,
                                          cpu_as);
                    DB_PRINT("No vector table, jump stub -> entry 0x%08X",
                             entry);
                }
            }
        }
    }

    DB_PRINT("S32K348EVB board init complete.");
}

/* ------------------------------------------------------------------
 *  Machine Class Init
 * ------------------------------------------------------------------ */
static void s32k348evb_machine_init(MachineClass *mc)
{
    mc->desc = "NXP S32K348EVB (BCOM Motor Controller)";
    mc->init = s32k348evb_board_init;
    mc->default_cpu_type = ARM_CPU_TYPE_NAME("cortex-m7");
    mc->default_ram_size = 0;   /* RAM is fixed on-chip */
    mc->no_parallel = 1;
    mc->no_floppy = 1;
    mc->no_cdrom = 1;
    /* QEMU 11: mc->no_sdcard is gone; auto_create_sdcard defaults to false */
}

DEFINE_MACHINE_EXTENDED("s32k348evb", MACHINE, S32K348EVBMachineState,
                        s32k348evb_machine_init, false,
                        arm_machine_interfaces)
